Repository: 12thpass/mailtrain
Catalog: languages/*.po
Languages: et

source: Official Mailtrain Partners
et: Ametlikud Mailtraini partnerid

source: Self hosted email newsletter app
et: Enda majutatud e-posti uudiskirjade rakendus

source: Need to be logged in to access restricted content
et: Pead olema sisse logitud, et näha peidetud sisu

source: Use TLS
et: Kasuta TLSi

source: usually selected for port 465
et: tavaliselt valitakse, kui port on 465

source: Use STARTTLS
et: Kasuta STARTTLSi

source: usually selected for port 587 and 25
et: tavaliselt valitakse, kui port on 587 või 25

source: Do not use encryption
et: Ära kasuta ühenduse krüpteerimist

source: Settings updated
et: Seaded uuendatud

source: Invalid mail transport type
et: Viga maili transpordi tüüp

source: Invalid Access Key
et: Vigae ligipääsuvõti

source: Invalid AWS credentials
et: VIgased AWS võtmed

source: Connection refused, check hostname and port.
et: Ühendusest keelduti, kontrolli domeeninime ja porti

source: Did not receive greeting message from server. This might happen when connecting to a TLS port without using TLS.
et: Ei saanud serverilt vastust, see juhtub tavaliselt kui ühendus TLS serverisse ilma TLS kasutamata

source: Did not receive greeting message from server.
et: Ei saanud serverilt vastust

source: Connection timed out. Check your firewall settings, destination port is probably blocked.
et: Ühendus aegus. Kontrolli oma tulemüüri seadeid, tõenäoliselt on serveir port blokeeritud

source: Authentication not accepted, server expects STARTTLS to be used.
et: Autentimist ei lubatud, server nõuab STARTTLS kasutamist

source: Authentication failed, check username and password.
et: Autentimine ebaõnnestus, kontrolli kasutajanime ja parooli

source: Failed Mailer verification.
et: E-posti seadistuse kontroll ebaõnnestus

source: Server responded with: "%s"
et: Server vastas "%s"

source: Mailer settings verified, ready to send some mail!
et: E-posti seaded on kontrollitud, võid hakata kirju saatma
